idaohang/stm32gps/Project/stm32gps/main.c
/**
 ******************************************************************************
 * @file    USART/Printf/main.c
 * @author  MCD Application Team
 * @version V3.5.0
 * @date    08-April-2011
 * @brief   Main program body
 ******************************************************************************
 * @attention
 *
 * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
 * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stm32f10x_it_api.h"
#include "stm32gps_board.h"
#include "stm32gps_config.h"
#include <stdio.h>
#include <string.h>
#include "usart.h"
#include "GSM_App.h"
#include "GPS_App.h"
#include "eelink.h"
#include "gpio.h"


/* Private typedef -----------------------------------------------------------*/

typedef struct
{
	unsigned char status[2];    // dveice status
	unsigned char analog1[2]; 	// analog input 1
	unsigned char analog2[2];		// analog input 2
}ST_DEVICEDATA, *pST_DEVICEDATA;

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define BKP_DR_NUMBER              42
/* Private variables ---------------------------------------------------------*/
__IO uint32_t LsiFreq = 40000;

// imei information buffer
uint8_t imeiBuf[IMEI_INFO_LEN];

// packet message
EELINK_SIM_PACKET_LOGIN loginMsg;
char loginBuf[PROTO_LOGIN_BUF];
EELINK_PACKET_GPS gpsMsg;
char gpsBuf[PROTO_GPS_BUF];

ST_SIMDATA g_simData;
ST_GPSDATA g_gpsData;
ST_DEVICEDATA g_deviceData;
ST_IMSIINFO g_imsiInfo;

uint16_t g_sequenceNum;  // GPRS packet's sequence number
uint16_t g_successNum;   // GPRS Send Success number

// Backup Data Register
uint16_t BKPDataReg[BKP_DR_NUMBER] =
  {
    BKP_DR1, BKP_DR2, BKP_DR3, BKP_DR4, BKP_DR5, BKP_DR6, BKP_DR7, BKP_DR8,
    BKP_DR9, BKP_DR10, BKP_DR11, BKP_DR12, BKP_DR13, BKP_DR14, BKP_DR15, BKP_DR16,
    BKP_DR17, BKP_DR18, BKP_DR19, BKP_DR20, BKP_DR21, BKP_DR22, BKP_DR23, BKP_DR24,
    BKP_DR25, BKP_DR26, BKP_DR27, BKP_DR28, BKP_DR29, BKP_DR30, BKP_DR31, BKP_DR32,
    BKP_DR33, BKP_DR34, BKP_DR35, BKP_DR36, BKP_DR37, BKP_DR38, BKP_DR39, BKP_DR40,
    BKP_DR41, BKP_DR42
  }; 

/* Private function prototypes -----------------------------------------------*/
uint8_t ProcessIMEI(uint8_t *pImei, uint8_t *pRst, int32_t imeilen, int32_t rstlen);
void loadLoginMsg(uint8_t *imei, uint16_t sequence);
void PackLoginMsg(void);
void LoadGpsMsg(uint16_t sequence);
void PackGpsMsg(void);
void PackAlarmMsg(void);
/* Private functions ---------------------------------------------------------*/

#ifdef DBG_ENABLE_MACRO
void ShowLoginMsg(void)
{
	uint32_t i;
	// imei
	printf("IMEI:");
	for(i = 0; i < IMEI_INFO_LEN; i++)
	{
		printf("%c-", imeiBuf[i]);
	}
	printf("\r\n");
	// login msg
	printf("LOGIN MSG:");
	for(i = 0; i < PROTO_LOGIN_BUF; i++)
	{
		printf("0x%x-", loginBuf[i]);
	}
	printf("\r\n");
}

void ShowGpsMsg(void)
{
	uint32_t i;
	// gps msg
	printf("GPS MSG:");
	for(i = 0; i < PROTO_GPS_BUF; i++)
	{
		printf("0x%x-", gpsBuf[i]);
	}
	printf("\r\n");
}
#endif

/**
  * @brief  Init Global Variables
  * @param  None
  * @retval None
  */
void InitVariables(void)
{
	uint32_t i;
	
	g_sequenceNum = 1;
	g_successNum = 0;
	
	memset(imeiBuf, sizeof(imeiBuf), 0);
	for(i = 0; i < PROTO_LOGIN_BUF; i++)
	{
		loginBuf[i] = 0;
	}
	for(i = 0; i < PROTO_GPS_BUF; i++)
	{
		gpsBuf[i] = 0;
	}

	memset(&loginMsg, sizeof(loginMsg), 0);
	memset(&gpsMsg, sizeof(gpsMsg), 0);

	memset(&g_simData, sizeof(g_simData), 0);
	memset(&g_gpsData, sizeof(g_gpsData), 0);
	memset(&g_deviceData, sizeof(g_deviceData), 0);
	
}

/**
  * @brief  Read PA15 Pin Status
  * @param  None
  * @retval None
  */
uint8_t getRemovalFlag(void)
{
	return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_15);
}

/**
 * @brief  Main program
 * @param  None
 * @retval None
 */
int main(void) 
{
	uint8_t gpsRecvTimes = 0;  // GPS Information Received times
	uint8_t rst = GPS_FAIL;    // GPS function return result
    ST_GPSRMCINFO rmc;         // GPS RMC packet information
	unsigned char errNum = 0;  // GPRS send error number
	uint16_t removeNum = 0;    // Remove detect counter
	uint16_t sendLen = 0;      // GPRS send length (used for GPS and ALARM Msg)

	// Used for parse GPRS Received Data
	char *pRecvBuf = NULL;     // GPRS Received buffer
    uint32_t recvLen = 0;      // GPRS Received length
	char *pfeed = NULL;        // Used for parse

/////////////////////////////////////////////////////////////////
// Configure the GPIO ports and Power OFF GPS and GSM
/////////////////////////////////////////////////////////////////
	MX_GPIO_Init();
#ifdef USE_STM32_GPS_BOARD_VB
	GPSPowerOff();
	GSM_PowerOff();
#endif
	/////////////////////////////////////////////////////////////////
	// Configure the SysTick
	/////////////////////////////////////////////////////////////////
	stm32gps_sys_tick_cfg();

	/////////////////////////////////////////////////////////////////
	// Configure PWR and BKP
	/////////////////////////////////////////////////////////////////
	/* Enable PWR and BKP clock */
  	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
  	/* Enable WKUP pin */
  	PWR_WakeUpPinCmd(ENABLE);
  	/* Allow access to BKP Domain */
  	PWR_BackupAccessCmd(ENABLE);
	
	/////////////////////////////////////////////////////////////////
	// Configure RCC
	/////////////////////////////////////////////////////////////////
	RCC_Configuration();
	
	/////////////////////////////////////////////////////////////////
	// Configure EXTI
	/////////////////////////////////////////////////////////////////
	EXTI_Configuration();
	
	/////////////////////////////////////////////////////////////////
	// Configure RTC
	/////////////////////////////////////////////////////////////////
	RTC_Configuration();
	RTC_NVIC_Configuration();
	
	/////////////////////////////////////////////////////////////////
	// Configure TIMER
	/////////////////////////////////////////////////////////////////
	TIM2_Configuration();
	TIM2_NVIC_Configuration();

	/////////////////////////////////////////////////////////////////
	// Init BKP Register when PowerOn Reset
	/////////////////////////////////////////////////////////////////
	/* Check if the Power On Reset flag is set */
	if(RCC_GetFlagStatus(RCC_FLAG_PORRST) != RESET)
	{
		/* Clear reset flags */
		RCC_ClearFlag();
		// Write BKP register Init BKP register
		BKP_WriteBackupRegister(BKPDataReg[BKP_SLEEP_TIME], (uint16_t)(SLEEP_NORMAL_SEC));
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_FLAG], (uint16_t)(BKP_FALSE));
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_YES], 0);
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_NOT], 0);
	}

	/////////////////////////////////////////////////////////////////
	// Configure LED and USART(GPS + GSM + DEBUG)
	/////////////////////////////////////////////////////////////////
#ifdef DBG_ENABLE_MACRO
    stm32gps_led_cfg();
	STM_EVAL_LEDOff(LED1);

    stm32gps_com_debug_cfg();
#endif

    usart_init(STM32_SIM908_GPS_COM);
    stm32gps_com_gps_cfg();

    usart_init(STM32_SIM908_GSM_COM);
    stm32gps_com_gsm_cfg();

	/////////////////////////////////////////////////////////////////
	// Tuen On TIMER
	/////////////////////////////////////////////////////////////////
	TIM2_Start();
	
	/////////////////////////////////////////////////////////////////
	// Init Variables
	/////////////////////////////////////////////////////////////////
	InitVariables();
	
	/////////////////////////////////////////////////////////////////
	// Check Remove Action, Pls refer documents and sch
	/////////////////////////////////////////////////////////////////
	// set remove flag
	if(BKP_FALSE == BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_FLAG]) 
		&& (BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_NOT]) > CHECK_REMOVE_TIMES))
	{
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_FLAG], (uint16_t)(BKP_TRUE));
	}

	// reset remove flag
	if(BKP_TRUE == BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_FLAG]) 
		&& (BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_YES]) > CHECK_REMOVE_TIMES))
	{
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_FLAG], (uint16_t)(BKP_FALSE));
	}
	
