idaohang/stm32gps/Project/stm32gps/main.c
	// have removed
	if((uint8_t)Bit_SET == getRemovalFlag())
	{
		removeNum = BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_YES]);
		removeNum++;
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_YES], removeNum);
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_NOT], 0);
	}
	
	// not removed
	if((uint8_t)Bit_RESET == getRemovalFlag()) 
	{
		removeNum= BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_NOT]);
		
		removeNum++;
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_NOT], removeNum);
		BKP_WriteBackupRegister(BKPDataReg[BKP_REMOVE_YES], 0);
	}

	/////////////////////////////////////////////////////////////////
	// First Power ON GPS
	/////////////////////////////////////////////////////////////////
	GPSPowerOn();
	while(1)
	{
		// delay 1 sec
		delay_10ms(100);
		/////////////////////////////////////////////////////////////////
		// Receive GPS Data and Analyze
		/////////////////////////////////////////////////////////////////
		rst = GPSInfoAnalyze(&rmc);
		if( GPS_SUCCESS == rst)
		{
#ifdef DBG_ENABLE_MACRO
			STM_EVAL_LEDOff(LED1);
			DEBUG("GPS Recv Success!\n");
#endif
			break;
		}
		else if(GPS_INVALID == rst)
		{
#ifdef DBG_ENABLE_MACRO
			STM_EVAL_LEDOn(LED1);
			DEBUG("GPS Recv Invalid\n");
#endif
		}
		else
		{
#ifdef DBG_ENABLE_MACRO
			STM_EVAL_LEDOn(LED1);
			DEBUG("GPS Recv Error\n");
#endif
		}
		/////////////////////////////////////////////////////////////////
		// If GPS Receive Times Over then break, ~30sec
		/////////////////////////////////////////////////////////////////
		gpsRecvTimes++;
		if(gpsRecvTimes > GPS_RETERY_TIMES)
		{
			gpsRecvTimes = 0;
			break;
		}

		/////////////////////////////////////////////////////////////////
		// Set RTC Alarm to wake from STOP mode
		/////////////////////////////////////////////////////////////////
		/* Wait till RTC Second event occurs */
	    RTC_ClearFlag(RTC_FLAG_SEC);
	    while(RTC_GetFlagStatus(RTC_FLAG_SEC) == RESET);

	    /* Alarm in 10 second */
	    RTC_SetAlarm(RTC_GetCounter()+ STOP_GPS_SEC);
	    /* Wait until last write operation on RTC registers has finished */
	    RTC_WaitForLastTask();
		
		/////////////////////////////////////////////////////////////////
		// Go Into STOP Mode
		/////////////////////////////////////////////////////////////////
		/* Request to enter STOP mode with regulator in low power mode*/
    	PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);

		/* Configures system clock after wake-up from STOP: enable HSE, PLL and select 
       		PLL as system clock source (HSE and PLL are disabled in STOP mode) */
    	SYSCLKConfig_STOP();
	}
	
	/////////////////////////////////////////////////////////////////
	// Second Power ON GSM
	/////////////////////////////////////////////////////////////////
	GSM_PowerOn();
	while(1)
	{
		g_sequenceNum = 1; // Init packet sequence to 1
		g_successNum = 0;
		errNum = 0;
		
		/////////////////////////////////////////////////////////////////
		// While loop to handshake with SIM800L module
		/////////////////////////////////////////////////////////////////
		GSM_Init();
		
		/////////////////////////////////////////////////////////////////
		// While loop to check sim card status
		/////////////////////////////////////////////////////////////////
		GSM_CheckSIMCard();

		/////////////////////////////////////////////////////////////////
		// While loop to check network registration status
		/////////////////////////////////////////////////////////////////
		GSM_CheckNetworkReg();
		
		/////////////////////////////////////////////////////////////////
		// While loop to check Attach or Detach from GPRS Service
		/////////////////////////////////////////////////////////////////
		GSM_CheckGPRSService();
		
		/////////////////////////////////////////////////////////////////
		// While loop to set network registration 
		// 2 Enable network registration unsolicited result code with
		// location information +CREG: <stat>[,<lac>,<ci>]
		/////////////////////////////////////////////////////////////////
		GSM_SetNetworkReg();
		
		/////////////////////////////////////////////////////////////////
		// Check CPIMode and While loop to Set CIPMODE
		/////////////////////////////////////////////////////////////////
		GSM_SetCIPMode(0);
		/////////////////////////////////////////////////////////////////
		// Check CSTT and (While loop 5) to Start task and Set APN "CMNET"
		/////////////////////////////////////////////////////////////////
		GSM_StartTaskAndSetAPN();
		/////////////////////////////////////////////////////////////////
		// (While loop 5) to Bring Up Wireless Connection
		/////////////////////////////////////////////////////////////////
		GSM_BringUpConnect();
		
		/////////////////////////////////////////////////////////////////
		// (While loop 5) to Get Local IP Address
		/////////////////////////////////////////////////////////////////
		GSM_GetLocalIP();
		
		/////////////////////////////////////////////////////////////////
		// While loop to Start Up TCP or UDP Connection
		/////////////////////////////////////////////////////////////////
		GSM_StartUpConnect();

		/////////////////////////////////////////////////////////////////
		// Query SIM IMEI and Package LOGIN Message
		/////////////////////////////////////////////////////////////////
		while(USART_SUCESS != GSM_QueryImei(imeiBuf));
		loadLoginMsg(imeiBuf, g_sequenceNum);
		PackLoginMsg();

		/////////////////////////////////////////////////////////////////
		// While loop to Send LOGIN Message
		/////////////////////////////////////////////////////////////////
		while(USART_SUCESS != GPRS_SendData_rsp(loginBuf, EELINK_LOGIN_MSGLEN, &pRecvBuf, &recvLen))
		{
#ifdef DBG_ENABLE_MACRO
			STM_EVAL_LEDToggle(LED1);
			DEBUG("GPRS_SendData LOGIN MSG Fail\n");
#endif
		}
		/*
		// parse response data
		pfeed = strstr_len(pRecvBuf, "gg", recvLen);
		if(pfeed != NULL)
		{
			printf("\r\n 2= 0x%x-", *(pfeed+2));
		}
		printf("\r\n");
		*/
		/////////////////////////////////////////////////////////////////
		// Query SIM IMSI and Analyze
		/////////////////////////////////////////////////////////////////
		while(USART_SUCESS != GSM_QueryImsi(&g_imsiInfo));

		/////////////////////////////////////////////////////////////////
		// While loop to Send GPS Message
		/////////////////////////////////////////////////////////////////
	    while(1)
	    {
			/////////////////////////////////////////////////////////////////
			// Receive GPS Data and Analyze
			/////////////////////////////////////////////////////////////////
			rst = GPSInfoAnalyze(&rmc);
			if( GPS_SUCCESS == rst)
			{
				DEBUG("GPS Recv Success!\n");
			}
			else if(GPS_INVALID == rst)
			{
				DEBUG("GPS Recv Invalid\n");
			}
			else
			{
				memset(&rmc, sizeof(rmc), 0);
				DEBUG("GPS Recv Error\n");
			}
			
			ParseGPSInfo(rmc, &g_gpsData);
			/////////////////////////////////////////////////////////////////
			// Get GSM related Data and Analyze, Package GPS Message
			/////////////////////////////////////////////////////////////////
			GetGsmData(&g_simData, g_imsiInfo);
			LoadGpsMsg(g_sequenceNum);

			// detect remove and alarm
			if((BKP_TRUE == BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_FLAG]))
				&&((BKP_ReadBackupRegister(BKPDataReg[BKP_REMOVE_YES]) > 0)))
			{
				PackAlarmMsg();
				sendLen = EELINK_ALARM_MSGLEN;
			}
			else
			{
				PackGpsMsg();
				sendLen = EELINK_GPS_MSGLEN;
			}

			/////////////////////////////////////////////////////////////////
			// Send GPS Message, 
			/////////////////////////////////////////////////////////////////
			if(USART_FAIL == GPRS_SendData(gpsBuf, sendLen))
			{
#ifdef DBG_ENABLE_MACRO
				STM_EVAL_LEDToggle(LED1);
#endif
				errNum++;
				if(errNum > GSM_RETERY_TIMES)
				{
					errNum = 0;
					GPRS_CloseLink();
					GPRS_CIPShut();
					break;
				}
				DEBUG("GPRS_SendData Fail\n");
			}
			else
			{

				// Increase success number
				g_successNum++;
			}
			
			// if send ok then into sleep
			if(g_successNum > GSM_SUCCESS_TIMES)
			{
				break;
			}
#ifdef DBG_ENABLE_MACRO
		ShowGpsMsg();
#endif

